spec/dummy/app/controllers/messages_controller.rb

  def index
    broadcast do
      @messages = Message.all
---
SELECT "messages".* FROM "messages"

  def show
    broadcast do
      @message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 3]]